import React from 'react';
import styles from './../styles.module.sass';
import { MyContext } from '@/components/Context/Context';
export const Boards = () => {
  const { showInput, show, inputValueWithdraw, changeInputValueWithdraw, transferOfMoney } =
    React.useContext(MyContext);
  return (
    <div>
      <div className={styles.display__flex}>
        <div>
          <div className={styles.dollar__board}>
            <h2 style={{ marginBottom: '15px' }}>US Dollar</h2>
            <p
              style={{
                marginBottom: '30px',
                borderBottom: '2px dashed #91EB94',
                paddingBottom: '25px',
              }}>
              80,435.712
            </p>
            <div className={styles.display__flex}>
              <svg xmlns="http://www.w3.org/2000/svg" height="17" viewBox="0 0 18 23" fill="none">
                <g filter="url(#filter0_d_1001_2317)">
                  <path
                    d="M13.086 4.99109C12.897 3.29209 12.0468 2.74713 10.2332 2.61709L10.1937 1L8.79071 1.02541L8.82891 2.58049C8.46051 2.58715 8.08369 2.60086 7.70947 2.61569L7.66946 1.04585L6.26776 1.0709L6.30861 2.6867L4 2.74173L4.02644 4.27668C4.02644 4.27668 4.54256 4.23793 4.52567 4.25783C5.09383 4.24791 5.2848 4.58232 5.34338 4.87308L5.45331 11.3402C5.43146 11.5238 5.33133 11.8176 4.93429 11.8247C4.95261 11.8408 4.43376 11.8416 4.43376 11.8416L4.18482 13.565L6.49275 13.5231L6.53397 15L7.93507 14.9751L7.89511 13.5236C8.28066 13.5246 8.65224 13.5213 9.01546 13.5145L9.05489 14.9551L10.4577 14.9297L10.4176 13.4571C12.7736 13.2761 13.8203 12.6379 13.9861 10.3672C14.1205 8.53759 13.2682 7.73734 11.9238 7.43169C12.7296 6.99205 13.2253 6.23572 13.0852 4.99224L13.086 4.99109ZM11.8032 10.1323C11.8333 11.9168 8.84862 11.7673 7.89746 11.785L7.84398 8.62143C8.79485 8.60461 11.7705 8.2717 11.8032 10.1323ZM11.0761 5.68041C11.1034 7.30444 8.6128 7.15921 7.82047 7.1733L7.77064 4.30361C8.56328 4.2897 11.0475 3.98709 11.0761 5.68041Z"
                    fill="white"
                  />
                </g>
              </svg>
              <p>0,0014</p>
            </div>
          </div>
          <div onClick={showInput} className={styles.withdraw}>
            <div
              style={{
                display: 'flex',
                alignItems: 'center',
                justifyContent: 'center',
              }}>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none">
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M12 4.63636C7.93318 4.63636 4.63636 7.93318 4.63636 12C4.63636 16.0668 7.93318 19.3636 12 19.3636C16.0668 19.3636 19.3636 16.0668 19.3636 12C19.3636 7.93318 16.0668 4.63636 12 4.63636ZM3 12C3 7.02944 7.02944 3 12 3C16.9706 3 21 7.02944 21 12C21 16.9706 16.9706 21 12 21C7.02944 21 3 16.9706 3 12Z"
                  fill="#60BC63"
                />
                <path
                  d="M11.418 8.15239C11.4299 8.14034 11.4421 8.12866 11.4548 8.11737C11.5219 8.05728 11.5965 8.01019 11.6754 7.97612C11.7749 7.93305 11.8847 7.90918 12.0001 7.90918L12.0025 7.90918C12.1091 7.9095 12.2108 7.93017 12.304 7.9675C12.404 8.00744 12.4977 8.06788 12.5786 8.14882L15.8514 11.4215C16.1709 11.7411 16.1709 12.2591 15.8514 12.5786C15.5318 12.8981 15.0138 12.8981 14.6943 12.5786L12.8182 10.7026V15.2728C12.8182 15.7247 12.4519 16.091 12.0001 16.091C11.5482 16.091 11.1819 15.7247 11.1819 15.2728V10.7026L9.3059 12.5786C8.98638 12.8981 8.46834 12.8981 8.14882 12.5786C7.8293 12.2591 7.8293 11.7411 8.14882 11.4215L11.418 8.15239Z"
                  fill="#60BC63"
                />
              </svg>
              Withdraw
            </div>
          </div>
        </div>
        <div>
          <div className={styles.bitcoin__board}>
            <h2 style={{ marginBottom: '15px' }}>Bitcoin</h2>
            <p
              style={{
                marginBottom: '30px',
                borderBottom: '2px dashed white',
                paddingBottom: '25px',
              }}>
              1.84333767
            </p>
            <div className={styles.display__flex}>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="16"
                height="16"
                viewBox="0 0 16 16"
                fill="none">
                <path
                  d="M9.65755 9.91272C9.65755 9.53908 9.53327 9.2429 9.2847 9.02419C9.04154 8.80091 8.62546 8.59586 8.03647 8.40904C7.44748 8.22222 6.93955 8.03768 6.51266 7.85542C6.08578 7.66859 5.71834 7.45671 5.41033 7.21977C5.10773 6.97827 4.86998 6.69576 4.69706 6.37224C4.52955 6.04872 4.4458 5.66369 4.4458 5.21714C4.4458 4.44707 4.73759 3.81598 5.32118 3.32387C5.90476 2.83176 6.68018 2.54469 7.64742 2.46267V1H8.94428V2.48318C9.90071 2.59709 10.6491 2.93428 11.1895 3.49474C11.7298 4.05065 12 4.77287 12 5.66141H9.65755C9.65755 5.11462 9.52246 4.7068 9.25228 4.43796C8.9875 4.16456 8.63087 4.02787 8.18237 4.02787C7.73928 4.02787 7.39615 4.13495 7.15299 4.34911C6.90983 4.55871 6.78825 4.85033 6.78825 5.22397C6.78825 5.57028 6.90713 5.84823 7.14488 6.05783C7.38264 6.26744 7.82303 6.4816 8.46606 6.70032C9.11449 6.91903 9.64674 7.12636 10.0628 7.32229C10.4789 7.51367 10.8301 7.73239 11.1165 7.97844C11.4029 8.21994 11.6217 8.4979 11.773 8.8123C11.9243 9.12215 12 9.4844 12 9.89905C12 10.6737 11.7136 11.3025 11.1408 11.7855C10.5681 12.2685 9.77913 12.5533 8.77406 12.6399V14H7.48531V12.6467C6.37758 12.5464 5.51841 12.2161 4.9078 11.6556C4.3026 11.0906 4 10.341 4 9.40694H6.34245C6.34245 9.94918 6.49375 10.3661 6.79635 10.6577C7.10436 10.9448 7.54475 11.0883 8.11753 11.0883C8.59304 11.0883 8.96859 10.9835 9.24417 10.7739C9.51976 10.5598 9.65755 10.2727 9.65755 9.91272Z"
                  fill="#FEFEFE"
                />
              </svg>
              <p>109106,60</p>
            </div>
          </div>
          <div onClick={showInput} className={styles.deposit}>
            <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'center' }}>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none">
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M12 19.3636C7.93318 19.3636 4.63636 16.0668 4.63636 12C4.63636 7.93318 7.93318 4.63636 12 4.63636C16.0668 4.63636 19.3636 7.93318 19.3636 12C19.3636 16.0668 16.0668 19.3636 12 19.3636ZM3 12C3 16.9706 7.02944 21 12 21C16.9706 21 21 16.9706 21 12C21 7.02944 16.9706 3 12 3C7.02944 3 3 7.02944 3 12Z"
                  fill="white"
                />

                <path
                  d="M11.418 15.8476C11.4299 15.8597 11.4421 15.8713 11.4548 15.8826C11.5219 15.9427 11.5965 15.9898 11.6754 16.0239C11.7749 16.067 11.8847 16.0908 12.0001 16.0908L12.0025 16.0908C12.1091 16.0905 12.2108 16.0698 12.304 16.0325C12.404 15.9926 12.4977 15.9321 12.5786 15.8512L15.8514 12.5785C16.1709 12.2589 16.1709 11.7409 15.8514 11.4214C15.5318 11.1019 15.0138 11.1019 14.6943 11.4214L12.8182 13.2974V8.72719C12.8182 8.27532 12.4519 7.909 12.0001 7.909C11.5482 7.909 11.1819 8.27532 11.1819 8.72719V13.2974L9.3059 11.4214C8.98638 11.1019 8.46834 11.1019 8.14882 11.4214C7.8293 11.7409 7.8293 12.2589 8.14882 12.5785L11.418 15.8476Z"
                  fill="white"
                />
              </svg>
              Deposit
            </div>
          </div>
        </div>
      </div>
      {show ? (
        <div>
          <h3 style={{ marginTop: '25px', marginBottom: '25px' }}>Money for withdraw or deposit</h3>
          <div style={{ display: 'flex', marginLeft: '-2em' }}>
            <label className={styles.inp}>
              <input
                value={inputValueWithdraw}
                onChange={changeInputValueWithdraw}
                type="text"
                className={styles.inp}
                placeholder="&nbsp;"
              />
              <span className={styles.label}>For the amount of</span>
              <span className={styles.focus__bg}></span>
            </label>
          </div>
          <div className={styles.wrapper} onClick={transferOfMoney}>
            <div className={styles.link_wrapper}>
              <a className={styles.link__a}>Continue</a>
              <div className={styles.icon}>
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 268.832 268.832">
                  <path d="M265.17 125.577l-80-80c-4.88-4.88-12.796-4.88-17.677 0-4.882 4.882-4.882 12.796 0 17.678l58.66 58.66H12.5c-6.903 0-12.5 5.598-12.5 12.5 0 6.903 5.597 12.5 12.5 12.5h213.654l-58.66 58.662c-4.88 4.882-4.88 12.796 0 17.678 2.44 2.44 5.64 3.66 8.84 3.66s6.398-1.22 8.84-3.66l79.997-80c4.883-4.882 4.883-12.796 0-17.678z" />
                </svg>
              </div>
            </div>
          </div>
        </div>
      ) : (
        ''
      )}
    </div>
  );
};
// Таска:
// 1) Есть withdraw - это как раз то что я должен реализовать как вывод средств
// План действий
// : Я должен при клике на withdraw вывести инпут сколько денег я готов мол отправить на вывод ✅
// : Я должен считать инпут через event.target.value и поместить это значение в inputValue и после чего при клике я должен в функцию setAmountOfMoney(amountOfMoney - inputValueWithDraw);
// : При нажатии на кнопку "-" я должен сбросить инпут и сделать amountOfMoney - inputInValueWithdraws
// После чего это должно отображаться на всех компонентах
